#==================================================
# 設定読み込み
#==================================================

# config = require './gulp/config.coffee'

#==================================================
# ライブラリ読み込み
#==================================================

gulp        = require 'gulp'
webserver   = require 'gulp-webserver'

#==================================================
# task
#==================================================
gulp.task 'webserver', ->
  gulp.src ''
    .pipe webserver
      livereload: true,
      host: '0.0.0.0'
      port: '8000'

# デフォルト
gulp.task 'default', ['webserver']

